export const KANJI_NUMBER = ['零', '〇', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '百', '千', '万', '億', '兆', '京', '垓'];
export const ROMAJI_CONVERT = {
    ".": "ten", "0": "zero", "1": "ichi", "2": "ni", "3": "san", "4": "yon", "5": "go", "6": "roku", "7": "nana",
    "8": "hachi", "9": "kyuu", "10": "juu", "100": "hyaku", "1000": "sen", "10000": "man", "100000000": "oku", "cho": "chō", "京": "kei", "垓": "gai",
    "秭": "shi", "穣": "jō", "300": "sanbyaku", "600": "roppyaku", "800": "happyaku", "3000": "sanzen", "8000": "hassen", "01000": "issen"
};

export const KANJI_CONVERT = {
    ".": "点", "0": "零", "1": "一", "2": "二", "3": "三", "4": "四", "5": "五", "6": "六", "7": "七",
    "8": "八", "9": "九", "10": "十", "100": "百", "1000": "千", "10000": "万", "100000000": "億", "億": "兆", "京": "京", "垓": "垓",
    "秭": "秭", "穣": "穣", "300": "三百", "600": "六百", "800": "八百", "3000": "三千", "8000": "八千", "01000": "一千", "zero": "〇"
};

export const HIRAGANA_CONVERT = {
    ".": "てん", "0": "ゼロ", "1": "いち", "2": "に", "3": "さん", "4": "よん", "5": "ご", "6": "ろく", "7": "なな",
    "8": "はち", "9": "きゅう", "10": "じゅう", "100": "ひゃく", "1000": "せん", "10000": "まん", "100000000": "おく", "cho": "ちょう", "京": "けい", "垓": "がい",
    "秭": "し", "穣": "じょう", "300": "さんびゃく", "600": "ろっぴゃく", "800": "はっぴゃく", "3000": "さんぜん", "8000": "はっせん", "01000": "いっせん"
};

export const HIRAGANA_HEX = 0x3041;
export const KATAKANA_HEX = 0x30a1;

export const KEY_CONVERT = { "kanji": KANJI_CONVERT, "hiragana": HIRAGANA_CONVERT, "romaji": ROMAJI_CONVERT };